STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215fxx_cm33.h
/******************  Bit definition for DCACHE_SR register  *******************/
#define DCACHE_SR_BUSYF_Pos                 (0U)
#define DCACHE_SR_BUSYF_Msk                 (0x1UL << DCACHE_SR_BUSYF_Pos)                   /*!< 0x00000001 */
#define DCACHE_SR_BUSYF                     DCACHE_SR_BUSYF_Msk                             /*!< full invalidate busy flag */
#define DCACHE_SR_BSYENDF_Pos               (1U)
#define DCACHE_SR_BSYENDF_Msk               (0x1UL << DCACHE_SR_BSYENDF_Pos)                 /*!< 0x00000002 */
#define DCACHE_SR_BSYENDF                   DCACHE_SR_BSYENDF_Msk                           /*!< full invalidate busy end flag */
#define DCACHE_SR_ERRF_Pos                  (2U)
#define DCACHE_SR_ERRF_Msk                  (0x1UL << DCACHE_SR_ERRF_Pos)                    /*!< 0x00000004 */
#define DCACHE_SR_ERRF                      DCACHE_SR_ERRF_Msk                              /*!< cache error flag */
#define DCACHE_SR_BUSYCMDF_Pos              (3U)
#define DCACHE_SR_BUSYCMDF_Msk              (0x1UL << DCACHE_SR_BUSYCMDF_Pos)                /*!< 0x00000008 */
#define DCACHE_SR_BUSYCMDF                  DCACHE_SR_BUSYCMDF_Msk                          /*!< command busy flag */
#define DCACHE_SR_CMDENDF_Pos               (4U)
#define DCACHE_SR_CMDENDF_Msk               (0x1UL << DCACHE_SR_CMDENDF_Pos)                 /*!< 0x00000010 */
#define DCACHE_SR_CMDENDF                   DCACHE_SR_CMDENDF_Msk                           /*!< command end flag */

/******************  Bit definition for DCACHE_IER register  ******************/
#define DCACHE_IER_BSYENDIE_Pos             (1U)
#define DCACHE_IER_BSYENDIE_Msk             (0x1UL << DCACHE_IER_BSYENDIE_Pos)               /*!< 0x00000002 */
#define DCACHE_IER_BSYENDIE                 DCACHE_IER_BSYENDIE_Msk                         /*!< interrupt enable on busy end */
#define DCACHE_IER_ERRIE_Pos                (2U)
#define DCACHE_IER_ERRIE_Msk                (0x1UL << DCACHE_IER_ERRIE_Pos)                  /*!< 0x00000004 */
#define DCACHE_IER_ERRIE                    DCACHE_IER_ERRIE_Msk                            /*!< interrupt enable on cache error */
#define DCACHE_IER_CMDENDIE_Pos             (4U)
#define DCACHE_IER_CMDENDIE_Msk             (0x1UL << DCACHE_IER_CMDENDIE_Pos)               /*!< 0x00000010 */
#define DCACHE_IER_CMDENDIE                 DCACHE_IER_CMDENDIE_Msk                         /*!< interrupt enable on command end */

/******************  Bit definition for DCACHE_FCR register  ******************/
#define DCACHE_FCR_CBSYENDF_Pos             (1U)
#define DCACHE_FCR_CBSYENDF_Msk             (0x1UL << DCACHE_FCR_CBSYENDF_Pos)               /*!< 0x00000002 */
#define DCACHE_FCR_CBSYENDF                 DCACHE_FCR_CBSYENDF_Msk                         /*!< clear full invalidate busy end flag */
#define DCACHE_FCR_CERRF_Pos                (2U)
#define DCACHE_FCR_CERRF_Msk                (0x1UL << DCACHE_FCR_CERRF_Pos)                  /*!< 0x00000004 */
#define DCACHE_FCR_CERRF                    DCACHE_FCR_CERRF_Msk                            /*!< clear cache error flag */
#define DCACHE_FCR_CCMDENDF_Pos             (4U)
#define DCACHE_FCR_CCMDENDF_Msk             (0x1UL << DCACHE_FCR_CCMDENDF_Pos)               /*!< 0x00000010 */
#define DCACHE_FCR_CCMDENDF                 DCACHE_FCR_CCMDENDF_Msk                         /*!< clear command end flag */

/****************  Bit definition for DCACHE_RHMONR register  *****************/
#define DCACHE_RHMONR_RHITMON_Pos           (0U)
#define DCACHE_RHMONR_RHITMON_Msk           (0xFFFFFFFFUL << DCACHE_RHMONR_RHITMON_Pos)      /*!< 0xFFFFFFFF */
#define DCACHE_RHMONR_RHITMON               DCACHE_RHMONR_RHITMON_Msk                       /*!< cache read-hit monitor counter */
#define DCACHE_RHMONR_RHITMON_0             (0x1UL << DCACHE_RHMONR_RHITMON_Pos)             /*!< 0x00000001 */
#define DCACHE_RHMONR_RHITMON_1             (0x2UL << DCACHE_RHMONR_RHITMON_Pos)             /*!< 0x00000002 */
#define DCACHE_RHMONR_RHITMON_2             (0x4UL << DCACHE_RHMONR_RHITMON_Pos)             /*!< 0x00000004 */
#define DCACHE_RHMONR_RHITMON_3             (0x8UL << DCACHE_RHMONR_RHITMON_Pos)             /*!< 0x00000008 */
#define DCACHE_RHMONR_RHITMON_4             (0x10UL << DCACHE_RHMONR_RHITMON_Pos)            /*!< 0x00000010 */
#define DCACHE_RHMONR_RHITMON_5             (0x20UL << DCACHE_RHMONR_RHITMON_Pos)            /*!< 0x00000020 */
#define DCACHE_RHMONR_RHITMON_6             (0x40UL << DCACHE_RHMONR_RHITMON_Pos)            /*!< 0x00000040 */
#define DCACHE_RHMONR_RHITMON_7             (0x80UL << DCACHE_RHMONR_RHITMON_Pos)            /*!< 0x00000080 */
#define DCACHE_RHMONR_RHITMON_8             (0x100UL << DCACHE_RHMONR_RHITMON_Pos)           /*!< 0x00000100 */
#define DCACHE_RHMONR_RHITMON_9             (0x200UL << DCACHE_RHMONR_RHITMON_Pos)           /*!< 0x00000200 */
#define DCACHE_RHMONR_RHITMON_10            (0x400UL << DCACHE_RHMONR_RHITMON_Pos)           /*!< 0x00000400 */
#define DCACHE_RHMONR_RHITMON_11            (0x800UL << DCACHE_RHMONR_RHITMON_Pos)           /*!< 0x00000800 */
#define DCACHE_RHMONR_RHITMON_12            (0x1000UL << DCACHE_RHMONR_RHITMON_Pos)          /*!< 0x00001000 */
#define DCACHE_RHMONR_RHITMON_13            (0x2000UL << DCACHE_RHMONR_RHITMON_Pos)          /*!< 0x00002000 */
#define DCACHE_RHMONR_RHITMON_14            (0x4000UL << DCACHE_RHMONR_RHITMON_Pos)          /*!< 0x00004000 */
#define DCACHE_RHMONR_RHITMON_15            (0x8000UL << DCACHE_RHMONR_RHITMON_Pos)          /*!< 0x00008000 */
#define DCACHE_RHMONR_RHITMON_16            (0x10000UL << DCACHE_RHMONR_RHITMON_Pos)         /*!< 0x00010000 */
#define DCACHE_RHMONR_RHITMON_17            (0x20000UL << DCACHE_RHMONR_RHITMON_Pos)         /*!< 0x00020000 */
#define DCACHE_RHMONR_RHITMON_18            (0x40000UL << DCACHE_RHMONR_RHITMON_Pos)         /*!< 0x00040000 */
#define DCACHE_RHMONR_RHITMON_19            (0x80000UL << DCACHE_RHMONR_RHITMON_Pos)         /*!< 0x00080000 */
#define DCACHE_RHMONR_RHITMON_20            (0x100000UL << DCACHE_RHMONR_RHITMON_Pos)        /*!< 0x00100000 */
#define DCACHE_RHMONR_RHITMON_21            (0x200000UL << DCACHE_RHMONR_RHITMON_Pos)        /*!< 0x00200000 */
#define DCACHE_RHMONR_RHITMON_22            (0x400000UL << DCACHE_RHMONR_RHITMON_Pos)        /*!< 0x00400000 */
#define DCACHE_RHMONR_RHITMON_23            (0x800000UL << DCACHE_RHMONR_RHITMON_Pos)        /*!< 0x00800000 */
#define DCACHE_RHMONR_RHITMON_24            (0x1000000UL << DCACHE_RHMONR_RHITMON_Pos)       /*!< 0x01000000 */
#define DCACHE_RHMONR_RHITMON_25            (0x2000000UL << DCACHE_RHMONR_RHITMON_Pos)       /*!< 0x02000000 */
#define DCACHE_RHMONR_RHITMON_26            (0x4000000UL << DCACHE_RHMONR_RHITMON_Pos)       /*!< 0x04000000 */
#define DCACHE_RHMONR_RHITMON_27            (0x8000000UL << DCACHE_RHMONR_RHITMON_Pos)       /*!< 0x08000000 */
#define DCACHE_RHMONR_RHITMON_28            (0x10000000UL << DCACHE_RHMONR_RHITMON_Pos)      /*!< 0x10000000 */
#define DCACHE_RHMONR_RHITMON_29            (0x20000000UL << DCACHE_RHMONR_RHITMON_Pos)      /*!< 0x20000000 */
#define DCACHE_RHMONR_RHITMON_30            (0x40000000UL << DCACHE_RHMONR_RHITMON_Pos)      /*!< 0x40000000 */
#define DCACHE_RHMONR_RHITMON_31            (0x80000000UL << DCACHE_RHMONR_RHITMON_Pos)      /*!< 0x80000000 */

